OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f040cxx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <description>desc I2C</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C2</name>
        <description>I2C2 Event Interrupt</description>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>Independent watchdog</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <displayName>KR</displayName>
          <description>Key register (IWDG_KR)</description>
          <addressOffset>0x0</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Prescaler register (IWDG_PR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>Prescaler divider</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <displayName>RLR</displayName>
          <description>Reload register (IWDG_RLR)</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0xFFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <description>Watchdog counter reload value</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register (IWDG_SR)</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>LCD CONTROLLER</description>
      <groupName>LCD</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD</name>
        <description>LCD global Interrupt</description>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CR0</name>
          <displayName>CR0</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCDCLK</name>
              <description>LCDCLK</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BIAS</name>
              <description>BIAS</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <description>DUTY</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>BSEL</name>
              <description>BSEL</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>CONTRAST</name>
              <description>CONTRAST</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>BLINKCNT</name>
              <description>BLINKCNT</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>BLINKEN</name>
              <description>BLINKEN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>INTF</name>
              <description>INTF</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <displayName>INTCLR</displayName>
          <description>INTCLR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>INTF_CLR</name>
              <description>INTF_CLR</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN0</name>
          <displayName>POEN0</displayName>
          <description>POEN0</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>S4</name>
              <description>S4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>S5</name>
              <description>S5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>S6</name>
              <description>S6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>S7</name>
              <description>S7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>S8</name>
              <description>S8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>S9</name>
              <description>S9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>S10</name>
              <description>S10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>S11</name>
              <description>S11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>S12</name>
              <description>S12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>S13</name>
              <description>S13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>S14</name>
              <description>S14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>S15</name>
              <description>S15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>S16</name>
              <description>S16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>S17</name>
              <description>S17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>S18</name>
              <description>S18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>S19</name>
              <description>S19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>S20</name>
              <description>S20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>S21</name>
              <description>S21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>S22</name>
              <description>S22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>S23</name>
              <description>S23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>S24</name>
              <description>S24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>S25</name>
              <description>S25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>S26</name>
              <description>S26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>S27</name>
              <description>S27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>S28</name>
              <description>S28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>S29</name>
              <description>S29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>S30</name>
              <description>S30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>S31</name>
              <description>S31</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN1</name>
          <displayName>POEN1</displayName>
          <description>POEN1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>S32</name>
              <description>S32</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>S33</name>
              <description>S33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>S34</name>
              <description>S34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S35</name>
              <description>S35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>S36C7</name>
              <description>S36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>S37C6</name>
              <description>S37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>S38C5</name>
              <description>S38</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>S39C4</name>
              <description>S39</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C0</name>
              <description>C0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>C1</name>
              <description>C1</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>C2</name>
              <description>C2</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>C3</name>
              <description>C3</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>MUX</name>
              <description>MUX</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM0</name>
          <displayName>RAM0</displayName>
          <description>des RAM0</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1</name>
          <displayName>RAM1</displayName>
          <description>des RAM1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM2</name>
          <displayName>RAM2</displayName>
          <description>des RAM2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM3</name>
          <displayName>RAM3</displayName>
          <description>des RAM3</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM4</name>
          <displayName>RAM4</displayName>
          <description>des RAM4</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM5</name>
          <displayName>RAM5</displayName>
          <description>des RAM5</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM6</name>
          <displayName>RAM6</displayName>
          <description>des RAM6</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM7</name>
          <displayName>RAM7</displayName>
          <description>des RAM7</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM8</name>
          <displayName>RAM8</displayName>
          <description>des RAM8</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM9</name>
          <displayName>RAM9</displayName>
          <description>des RAM9</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM10</name>
          <displayName>RAM10</displayName>
          <description>des RAM10</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM11</name>
          <displayName>RAM11</displayName>
          <description>des RAM11</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM12</name>
          <displayName>RAM12</displayName>
          <description>des RAM12</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM13</name>
          <displayName>RAM13</displayName>
          <description>des RAM13</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM14</name>
          <displayName>RAM14</displayName>
          <description>des RAM14</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM15</name>
          <displayName>RAM15</displayName>
          <description>des RAM15</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
